app/views/users/profile.html.erb

SELECT  `posts`.* FROM `posts` WHERE `posts`.`user_id` = NULL LIMIT 1
---
                                   <ul class="mail-list">
                                    <% post = Post.all.where(user_id: current_user) %>