app/views/posts/_form.html.erb

SELECT `locations`.* FROM `locations`
---
    <%= f.label :location_id %>
    <%= f.select :location_id, Location.all.collect { |p| [ p.location_name, p.id ] }, include_blank: "Location", class: "bootstrap-select"%>