app/views/posts/show.html.erb

        <!-- Posted Comments -->
        <% if @post.comments.any? %>
---
SELECT  1 AS one FROM `comments` WHERE `comments`.`post_id` = 1 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`posts_id` = 2 LIMIT 1