app/controllers/comments_controller.rb

INSERT INTO `comments` (`user_id`, `post_id`, `comment`, `created_at`, `updated_at`) VALUES (1, 2, 'qưeqưe', '2016-11-15 02:15:14', '2016-11-15 02:15:14')
---
  def create
    @cmt = current_user.comments.build comment_params
    if @cmt.save