app/controllers/posts_controller.rb

    def create
        @post = Post.new(params.require(:post).permit(:title, :content,:location_id))
        @post.assign_attributes(user_id: current_user.id)
        @post.save
---
INSERT INTO `posts` (`title`, `content`, `user_id`, `location_id`, `created_at`, `updated_at`) VALUES ('my tittle', '<p>asdasdasd</p>\r\n', 1, 1, '2016-11-13 14:42:04', '2016-11-13 14:42:04')

    def show
        @post = Post.includes(:comments).find_by(id: params[:id])
        @user = User.find(@post.user_id)
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`posts_id` = 2 LIMIT 1
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
SELECT  `posts`.* FROM `posts` WHERE (5) LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1