app/controllers/users_controller.rb

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO `users` (`email`, `password_digest`, `name`, `birthday`, `sex`, `address`, `phone`, `avatar`, `created_at`, `updated_at`) VALUES ('example@railstutorial.org', '$2a$10$mGlhCpE7jOGgfxNfKxb7U.EU0bK1xfH0YJGpJLtDHqha0uND84NpW', '11', '1955-12-11', 'male', '123123', '0935253027', 'books-icon-512.png', '2016-11-12 03:12:23', '2016-11-12 03:12:23')

  def index
    @users = User.search(params[:key]).paginate page: params[:page],
      per_page: 16
---
SELECT  `users`.* FROM `users` WHERE (name LIKE '%%') LIMIT 16 OFFSET 0
SELECT COUNT(*) FROM `users` WHERE (name LIKE '%%')

  def load_user
    @user = User.find_by id: params[:id]
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1